var __pa_data = [
  {
    "id": "p1786343751315",
    "num": 1,
    "view": "task-create",
    "sectionIdx": 2,
    "offsetX": 335,
    "offsetY": 21,
    "text": "-当前页面需要登录才可以访问，如果用户没有登录，点击模块跳转到登录页\n-此处默认展示从教师任课关系中获取的年级和班级、科目，如果只有一个，则默认选中，否则默认为空，需要用户自己选择，所有可选项均为必填项",
    "createdAt": "2026/8/10 14:35:51",
    "updatedAt": "2026/8/10 14:37:21",
    "done": true
  },
  {
    "id": "p1786343844283",
    "num": 2,
    "view": "task-create",
    "sectionIdx": 6,
    "offsetX": 333,
    "offsetY": 35,
    "text": "任务名称规则为：年级+学科+日期（月日）+作业，根据用户选择的自动生成，生成后支持修改，字数最长50个字，不支持为空",
    "createdAt": "2026/8/10 14:37:24",
    "updatedAt": "2026/8/10 14:40:48",
    "done": true
  },
  {
    "id": "p1786347119495",
    "num": 3,
    "view": "task-create",
    "sectionIdx": 7,
    "offsetX": 213,
    "offsetY": 18,
    "text": "-支持用户选择历史已经创建过的自由作业记录，可选择的历史记录为同学校同年级同学科的自由作业，按创建时间由近到远排序",
    "createdAt": "2026/8/10 15:31:59",
    "updatedAt": "2026/8/10 15:33:41",
    "done": true
  },
  {
    "id": "p1786370961505",
    "num": 4,
    "view": "answer-scan",
    "sectionIdx": -1,
    "offsetX": 147,
    "offsetY": 197,
    "text": "-支持两种方式扫描，从用户层面上一个是扫描老师手写的答案，另一种是扫描学生的满分答卷，从实现角度区别在于老师扫描的答案卷只用于识别模板、答案，用完了这份图片就丢弃掉，但如果是学生答卷，扫描完了数据要保留，作为学生作业进行识别",
    "createdAt": "2026/8/10 22:09:21",
    "updatedAt": "2026/8/10 22:10:35",
    "done": true
  },
  {
    "id": "p1786371048223",
    "num": 5,
    "view": "answer-scan",
    "sectionIdx": -1,
    "offsetX": 770,
    "offsetY": 289,
    "text": "-点击按钮调起扫描仪扫描图片\n-如果调用扫描仪失败或者识别失败，toast提示错误原因并停留在当前页面",
    "createdAt": "2026/8/10 22:10:48",
    "updatedAt": "2026/8/10 22:13:26",
    "done": true
  },
  {
    "id": "p1786373311104",
    "num": 10,
    "view": "answer-review",
    "sectionIdx": -1,
    "offsetX": 233,
    "offsetY": 300,
    "text": "-渲染框可以拖动调整位置，选择填空题展示对应答案\n-展示标题区的渲染框，用于识别学生正反，支持修改",
    "createdAt": "2026/8/10 22:48:31",
    "updatedAt": "2026/8/10 22:48:33",
    "done": true
  },
  {
    "id": "p1786373334864",
    "num": 12,
    "view": "answer-review",
    "sectionIdx": -1,
    "offsetX": 1332,
    "offsetY": 587,
    "text": "-展示识别到的题目和对应答案，答案可以修改；如果模板识别过程中，就识别出无法批改，则答案置空；题目可以增加或者删除，增加或者删除左右联动；左侧选中切图右侧联动，右侧点击答案输入框，左侧框选区域高亮显示\n-可以按题选择智能批改或者采集教师分数，采集教师分数则识别教师对错符号或者分数\n-如果是选择了智能批改，该题答案不能为空，如果是采集教师分数，可以不设置答案",
    "createdAt": "2026/8/10 22:48:54",
    "updatedAt": "2026/8/10 22:48:58",
    "done": true
  }
];
