var __pa_data = [
  {
    "id": "p1786343751315",
    "num": 1,
    "view": "main",
    "sectionIdx": 2,
    "offsetX": 335,
    "offsetY": 21,
    "text": "-当前页面需要登录才可以访问，如果用户没有登录，点击模块跳转到登录页\n-此处默认展示从教师任课关系中获取的年级和班级、科目，如果只有一个，则默认选中，否则默认为空，需要用户自己选择，所有可选项均为必填项",
    "createdAt": "2026/8/10 14:35:51",
    "updatedAt": "2026/8/10 14:37:21",
    "done": true
  },
  {
    "id": "p1786343844283",
    "num": 2,
    "view": "main",
    "sectionIdx": 6,
    "offsetX": 333,
    "offsetY": 35,
    "text": "任务名称规则为：年级+学科+日期（月日）+作业，根据用户选择的自动生成，生成后支持修改，字数最长50个字，不支持为空",
    "createdAt": "2026/8/10 14:37:24",
    "updatedAt": "2026/8/10 14:40:48",
    "done": true
  }
];
